import React, {Component} from 'react';

import Main from './Main';

require('../styles/main.scss');

export default class App extends Component {
  constructor(props) {
    super(props);
    // this.ButtonClick = this.ButtonClick.bind(this);
  }

  render() {
    let booksList = [
        {
          'key': '1',
          'img': 'http://animedia-company.cz/wp-content/uploads/2013/03/cover1-1024-350x466.jpg',
          'name': 'Капитанская дочка',
          'about': 'Н. Н., немолодой светский человек, вспоминает историю, которая приключилась, когда ему было лет двадцать пять. Н. Н. тогда путешествовал без цели и без плана и на пути своём остановился в тихом немецком городке N. Однажды Н. Н., придя на студенческую вечеринку, познакомился в толпе с двумя русскими — молодым художником, назвавшимся Гагиным, и его сестрой Анной, которую Гагин называл Асей. Н. Н. избегал русских за границей, но новый знакомый ему понравился сразу. Гагин пригласил Н. Н. к себе домой, на квартиру, в которой они с сестрою остановились. Н. Н. был очарован своими новыми друзьями. Ася сначала дичилась Н. Н., но скоро уже сама заговаривала с ним. Наступил вечер, пришла пора ехать домой. Уезжая от Гагиных, Н. Н. почувствовал себя счастливым.',
        },
        {
          'key': '2',
          'img': 'http://ptiburdukov.ru/pick/712-01.gif',
          'name': 'Отцы и дети',
          'about': '20 мая 1859 г. Николай Петрович Кирсанов, сорокатрехлетний, но уже немолодой с виду помещик, волнуясь, ожидает на постоялом дворе своего сына Аркадия, который только что окончил университет. Николай Петрович был сыном генерала, но предназначенная ему военная карьера не состоялась (он в молодости сломал ногу и на всю жизнь остался «хроменьким»). Николай Петрович рано женился на дочке незнатного чиновника и был счастлив в браке. К его глубокому горю, супруга в 1847 г. скончалась. Все свои силы и время он посвятил воспитанию сына, даже в Петербурге жил вместе с ним и старался сблизиться с товарищами сына, студентами. Последнее время он усиленно занялся преобразованием своего имения.',
        },
        {
          'key': '3',
          'img': 'http://apk-knigi.ru/uploads/posts/2014-11/1414992588_master-i-margarita.jpg',
          'name': 'Мастер и Маргарита',
          'about': 'В произведении — две сюжетные линии, каждая из которых развивается самостоятельно. Действие первой разворачивается в Москве в течение нескольких майских дней (дней весеннего полнолуния) в 30-х гг. XX века, действие же второй происходит тоже в мае, но в городе Ершалаиме (Иерусалиме) почти две тысячи лет тому назад — в самом начале новой эры. Роман построен таким образом, что главы основной сюжетной линии перемежаются главами, составляющими вторую сюжетную линию, причём эти вставные главы являются то главами из романа мастера, то рассказом очевидца событий Воланда.',
        },
        {
          'key': '4',
          'img': 'http://modernlib.ru/books/bulgakov_mihail_afanasevich/sobache_serdce/cover.jpg',
          'name': 'Собачье сердце',
          'about': 'Зима 1924/25 гг. Москва. Профессор Филипп Филиппович Преображенский открыл способ омоложения организма посредством пересадки людям желёз внутренней секреции животных. В своей семикомнатной квартире в большом доме на Пречистенке он ведёт приём пациентов. В доме проходит «уплотнение»: в квартиры прежних жильцов вселяют новых — «жилтоварищей». К Преображенскому приходит председатель домкома Швондер с требованием освободить две комнаты в его квартире. Однако профессор, позвонив по телефону одному из своих высокопоставленных пациентов, получает на свою квартиру броню, и Швондер уходит ни с чем.',
        },
        {
          'key': '5',
          'img': 'http://lozero.ru/image/0/63/6310.jpg',
          'name': 'Дубровский',
          'about': 'В своём поместье Покровское живёт богатый и знатный барин Кирила Петрович Троекуров. Зная его крутой нрав, его боятся все соседи, кроме бедного помещика Андрея Гавриловича Дубровского, отставного поручика гвардии и бывшего сослуживца Троекурова. Оба они вдовцы. Дубровский имеет сына Владимира, служащего в Петербурге, а у Троекурова есть дочь Маша, живущая с отцом, и Троекуров часто заговаривает о своём желании женить детей.',
        },
        {
          'key': '6',
          'img': 'http://knigatop.com/img_post/88172689153.jpg',
          'name': 'Толстый и тонкий',
          'about': 'На вокзале встречаются два приятеля: один толстый — Миша, другой тонкий — Порфирий. Тонкий вспоминает, как они вместе учились в гимназии, хвастается перед другом женой и сыном, рассказывает, что служит коллежским асессором. Но стоит ему узнать, что школьный товарищ дослужился до тайного советника и имеет звание выше, как его отношение к толстому резко меняется: он начинает говорить с другом подобострастным тоном, которым привык обращаться к начальству. Толстый морщится — для него статус друга не имеет значения. Тонкий не в силах победить свойственное ему чинопочитание. У него такое преданное выражение лица, что толстого начинает тошнить.',
        },
        {
          'key': '7',
          'img': 'http://audioknigi.me/img/1/8842-derevnya.jpg',
          'name': 'Деревня',
          'about': 'На вокзале встречаются два приятеля: один толстый — Миша, другой тонкий — Порфирий. Тонкий вспоминает, как они вместе учились в гимназии, хвастается перед другом женой и сыном, рассказывает, что служит коллежским асессором. Но стоит ему узнать, что школьный товарищ дослужился до тайного советника и имеет звание выше, как его отношение к толстому резко сразу меняется: он начинает говорить с другом подобострастным тоном, которым привык обращаться к начальству. Толстый морщится — для него статус друга не имеет значения. Тонкий не в силах победить свойственное ему чинопочитание. У него такое преданное выражение лица, что толстого начинает тошнить.',
        },
        {
          'key': '8',
          'img': 'https://i.livelib.ru/boocover/1000595913/o/b0ec/I._S._Turgenev__Asya.jpeg',
          'name': 'Ася',
          'about': 'Н. Н., немолодой светский человек, вспоминает историю, которая приключилась, когда ему было лет двадцать пять. Н. Н. тогда путешествовал без цели и без плана и на пути своём остановился в тихом немецком городке N. Однажды Н. Н., придя на студенческую вечеринку, познакомился в толпе с двумя русскими — молодым художником, назвавшимся Гагиным, и его сестрой Анной, которую Гагин называл Асей. Н. Н. избегал русских за границей, но новый знакомый ему понравился сразу. Гагин пригласил Н. Н. к себе домой, на квартиру, в которой они с сестрою остановились. Н. Н. был очарован своими новыми друзьями. Ася сначала дичилась Н. Н., но скоро уже сама заговаривала с ним. Наступил вечер, пришла пора ехать домой. Уезжая от Гагиных, Н. Н. почувствовал себя счастливым.',
        }
    ];
    return (
      <div>
        <Main data={booksList}/>
      </div>
    );
  }
}
